package network

/*
0               4   5   6   7   8 (BYTE)
+---------------+---+---+---+---+
|     token     | serial number |
+---------------+---+---+-------+   8
|     ts        |     sn        |
+---------------+---------------+  16
|     una       |     len       |
+---------------+---------------+  24
|                               |
|        DATA (optional)        |
|                               |
+-------------------------------+

token（32Bites）
	连接的唯一标识符号
	Client的第一个消息写0，Server的回复的消息具体填写
serial number（32Bites）消息序列号
*/